In [2]:
import numpy as np
import pandas as pd

from pandas import Series, DataFrame
from numpy.random import randn

In [4]:
ser1 = Series(randn(6), index=[[1,1,1,2,2,2], ['a', 'b', 'c', 'a', 'b', 'c']])

In [5]:
ser1

1  a    0.382802
   b    0.842349
   c    1.338472
2  a   -0.104658
   b    0.335504
   c   -0.673827
dtype: float64

In [6]:
ser.index

MultiIndex(levels=[[1, 2], ['a', 'b', 'c']],
           codes=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [7]:
ser[1]

a    1.279178
b    1.562325
c    0.979672
dtype: float64

In [8]:
ser[2]

a    0.049860
b    0.700286
c    0.492558
dtype: float64

In [9]:
ser

1  a    1.279178
   b    1.562325
   c    0.979672
2  a    0.049860
   b    0.700286
   c    0.492558
dtype: float64

In [11]:
ser[:,'a']

1    1.279178
2    0.049860
dtype: float64

In [12]:
df1 = ser.unstack()

In [13]:
df1

          a         b         c
1  1.279178  1.562325  0.979672
2  0.049860  0.700286  0.492558

In [14]:
df2 = DataFrame(np.arange(16).reshape((4,4)), index=[['a', 'a', 'b', 'b'], [1,2,1,2]], columns=[['NY', 'NY', 'LA', 'SF'],['cold', 'hot', 'hot', 'cold']])

In [15]:
df2

      NY      LA   SF
    cold hot hot cold
a 1    0   1   2    3
  2    4   5   6    7
b 1    8   9  10   11
  2   12  13  14   15

In [16]:
df2.index.names = ['INDEX_1', 'INDEX_2']

df2.columns.names = ['Cities', 'Temp']

In [17]:
df2

Cities            NY      LA   SF
Temp            cold hot hot cold
INDEX_1 INDEX_2
a       1          0   1   2    3
        2          4   5   6    7
b       1          8   9  10   11
        2         12  13  14   15

In [18]:
df2.swaplevel('Cities', 'Temp', axis=1)

Temp            cold hot     cold
Cities            NY  NY  LA   SF
INDEX_1 INDEX_2
a       1          0   1   2    3
        2          4   5   6    7
b       1          8   9  10   11
        2         12  13  14   15

In [20]:
df2.sum(level='Temp',axis=1)

Temp             cold  hot
INDEX_1 INDEX_2
a       1           3    3
        2          11   11
b       1          19   19
        2          27   27